backend/app/controllers/beers_controller.rb

    def show
        @beer = @user.beers.find_by(id: params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."user_id" = ? AND "beers"."id" = ? LIMIT ?  [["user_id", 2], ["id", nil], ["LIMIT", 1]]

    def create
        @beer= @user.beers.build(beer_params)
        if @user.valid? && @beer.save
---
INSERT INTO "beers" ("name", "malt_type", "malt_amount", "hop_type", "hop_amount", "yeast_type", "yeast_amount", "water_ph", "water_amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
        @beer = Beer.find_by_id(params[:id])
        if @user.valid? && @beer
          @beer.destroy
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 9]]

    def find_user
        @user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]