backend/app/controllers/beers_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_user
        @user = User.find_by(id: params[:user_id])