backend/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "eric 6"], ["password_digest", "$2a$12$9B7uyWQ0OWyHYQB7fkztOuAZokrpVMN5GiOMiDcMN9FUAHiGuBmqG"], ["created_at", "2021-04-02 15:21:03.741441"], ["updated_at", "2021-04-02 15:21:03.741441"]]